app/views/comments/_show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "user_id", "post_id", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-12-06 11:29:56.123371"], ["updated_at", "2022-12-06 11:29:56.123371"], ["user_id", 3], ["post_id", 22], ["body", "no reload"]]
---
    <blockquote class="blockquote mb-0">
      <h6 class="card-subtitle mb-2 text-muted"><%= User.find(comment.user_id).name %></h6>
      <p><%= comment.body %></p>
      <footer class="blockquote-footer"><%= comment.created_at.to_fs(:time) %> on <cite title="Source Title"><%= comment.created_at.to_date.to_fs(:rfc822) %></cite></footer>