app/views/friends/index.html.erb

              <div class="card-body">
                <h5 class="card-title"><%= User.find(@friend_request.user_id).name %></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]

    <div class="row">
    <% @users = User.all %>
    <% @friend_ids = [] %>
    <% @friends = Friendship.where(user_id: current_user.id).each { |f| @friend_ids << f.friend_id } %>
---
SELECT "users".* FROM "users"
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 3]]