app/views/friends/index.html.erb

SELECT "users".* FROM "users"
---

<% @users = User.all %>