app/views/likes/_form.html.erb

<% @post = Post.find(params[:id]) %>
<% if @post.likes.where(:user_id => current_user.id).empty? %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2  [["post_id", 26], ["user_id", 83]]
SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 26], ["user_id", 83], ["LIMIT", 1]]

<% else %>
<%= form_tag like_path(@post.likes.where(:user_id => current_user.id)[0].id), method: :delete do %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2  [["post_id", 26], ["user_id", 83]]