app/views/users/show.html.erb

                      <div class="card-body">
                        <h6 class="card-subtitle mb-2 text-muted"><%= (User.find(post.user_id)).name %></h6>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]