app/views/friend_requests/_index.html.erb

  <ul class="list-group list-group-flush">
  <% if current_user.friend_requests.empty? %>
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1  [["user_id", 2]]
SELECT 1 AS one FROM "friend_requests" WHERE "friend_requests"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

  <% else %>
    <% current_user.friend_requests.each do |req| %>
      <li class="list-group-item"><%= User.find(req.friend_id).name %></li>
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]

  <ul class="list-group list-group-flush">
  <% if FriendRequest.where(friend_id: current_user.id).empty? %>
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1  [["friend_id", 2]]
SELECT 1 AS one FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1 LIMIT $2  [["friend_id", 5], ["LIMIT", 1]]

  <% else %>
      <% FriendRequest.where(friend_id: current_user.id).each do |incoming| %>
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1  [["friend_id", 3]]

        <% @friend_request = incoming %>
        <%= User.find(@friend_request.user_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]