app/views/posts/_post.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "body") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-12-05 13:35:56.140553"], ["updated_at", "2022-12-05 13:35:56.140553"], ["user_id", 3], ["body", "welcome"]]
---
  <div class="card-body">
    <h6 class="card-subtitle mb-2 text-muted"><%= (User.find(@post.user_id)).name %></h6>
    <p class="text-muted">at <%= @post.created_at.to_date > Time.now.to_date ? @post.created_at.to_fs(:rfc822) : @post.created_at.to_fs(:time) %></p>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 16]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 23]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 21]]
---
  <div data-target="comments.commentList">
      <h6>Comments (<%= @post.comments.count %>) Likes (<%= @post.likes.count %>)</h6>
      <% @post.comments.each do |comment| %>