app/views/posts/_posts.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <div class="card-body">
    <h6 class="card-subtitle mb-2 text-muted"><%= (User.find(post.user_id)).name %></h6>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 21]]
---
      <div class="col">
          <%= link_to "Comments (#{post.comments.count})", post_path(post.id), class: "card-link" %>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["user_id", 83], ["id", 24], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 26], ["user_id", 83], ["LIMIT", 1]]
---
          <div class="row">
              <% if post.likes.where(:user_id => current_user.id).empty? %>

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2  [["post_id", 25], ["user_id", 83]]
---
                      <% elsif post.likes.count == 1 %>
                          <span><%= User.find(post.likes.first.user_id).name %> likes this</span>