app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id
    @comment.save

    respond_to do |format|
      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "user_id", "post_id", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-12-06 10:49:17.403586"], ["updated_at", "2022-12-06 10:49:17.403586"], ["user_id", 3], ["post_id", 21], ["body", "okay"]]
INSERT INTO "comments" ("created_at", "updated_at", "user_id", "post_id", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-12-06 11:31:41.896872"], ["updated_at", "2022-12-06 11:31:41.896872"], ["user_id", 3], ["post_id", 22], ["body", "yo"]]