app/controllers/friend_requests_controller.rb

    def create
      @user = current_user
      @friend_request = @user.friend_requests.build(friend_id: params[:friend_id])
      @friend_request.user_id = current_user.id

      if @friend_request.save
---
INSERT INTO "friend_requests" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["friend_id", 1], ["created_at", "2022-12-07 10:14:17.870032"], ["updated_at", "2022-12-07 10:14:17.870032"]]

    def set_friend_request
      @friend_request = FriendRequest.find(params[:id])
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]