app/controllers/friend_requests_controller.rb

    def create
      friend = User.find(params[:friend_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]