app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.build
    @like.user_id = current_user.id
    @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-12-18 05:42:14.114592"], ["updated_at", "2022-12-18 05:42:14.114592"], ["user_id", 83], ["post_id", 24]]

  def destroy
    @like = current_user.likes.find(params[:id])
    @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["user_id", 83], ["id", 25], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 11]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]