app/controllers/pages_controller.rb

    def home
        @post = Post.new
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC