app/controllers/posts_controller.rb

  def create
    @user = User.find(current_user.id)
    @post = @user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "body") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-12-05 13:35:56.140553"], ["updated_at", "2022-12-05 13:35:56.140553"], ["user_id", 3], ["body", "welcome"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = $1, "body" = $2 WHERE "posts"."id" = $3  [["updated_at", "2022-12-07 13:23:04.307535"], ["body", "bew oisty"], ["id", 23]]