app/models/friendship.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["friend_id", 3], ["created_at", "2022-12-18 07:47:44.073896"], ["updated_at", "2022-12-18 07:47:44.073896"]]
---
  def create_inverse_relationship
    # friendship.friendships.create(friend: user)
    inverse_friendship = User.find(friend_id).friendships.build(:friend_id => user_id)
    inverse_friendship.save