app/models/friend_request.rb

  def accept
    friendship = user.friendships.build(:friend_id => friend.id)
    destroy
    friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["friend_id", 8], ["created_at", "2022-12-18 07:37:49.707303"], ["updated_at", "2022-12-18 07:37:49.707303"]]